#!/usr/bin/env perl

use strict;
use warnings;
use utf8;

use FindBin;
use lib "$FindBin::Bin/../lib";

use Rplus::Model::Media;
use Rplus::Model::Media::Manager;

use JSON;

my $media = Rplus::Model::Media::Manager->get_objects(query => [type => 'import', code => 'present', delete_date => undef])->[0];
exit unless $media;

my $metadata = {
    params => {
        dict => {
            ap_schemes => {
                __field__ => 'ap_scheme_id',
                '^стал\.?$' => 1,
                '^хрущ\.?$' => 2,
                '^(?:улучш\.?\s+план\.?)|(?:план\.?\s+улучш\.?)|(?:улучш\.)$' => 3,
                '^брежн\.?$' => 3,
                '^нов\.?\s+план\.?$' => 4,
                '^инд\.?\s+план\.?$' => 5,
                '^общежити' => 6,
            },

            balconies => {
                __field__ => 'balcony_id',
                '^б\/балк\.?$' => 1,
                '^б\/б$' => 1,
                '^балк\.?$' => 2,
                '^лодж\.?$' => 3,
                '^б\/з$' => 5,
                '^л\/з$' => 6,
                '^2\s+балк\.?$' => 7,
                '^2\s+лодж\.?$' => 8,
            },

            bathrooms => {
                __field__ => 'bathroom_id',
                '^без\s+удобств$' => 1,
                '^с\/у\s+разд\.?$' => 3,
                '^с\/у\s+совм\.?$' => 8,
                '^смежн\.?\s+с\/у$' => 8,
                '^с\/у\s+смежн\.?$' => 8,
            },

            conditions => {
                __field__ => 'condition_id',
                '^после\s+строит\.?$' => 1,
                '^п\/строит\.?$' => 1,
                '^соц\.?\s+ремонт$' => 2,
                '^сделан ремонт$' => 3,
                'еврорем' => 4,
                '^дизайнерский ремонт$' => 5,
                '^треб\.?\s+ремонт$' => 6,
                '^тр\.?\s+ремонт$' => 6,
                '^т\.\s*к\.\s*р\.$' => 7,
                '^сост\.?\s+удовл\.?$' => 9,
                '^удовл\.?\s+сост\.?$' => 9,
                '^норм\.?\s+сост\.?$' => 10,
                '^сост\.?\s+норм\.?$' => 10,
                '^сост\.?\s+хор\.?$' => 11,
                '^хор\.?\s+сост\.?$' => 11,
                '^отл\.?\s+сост\.?$' => 12,
                '^сост\.?\s+отл\.?$' => 12,
            },

            house_types => {
                __field__ => 'house_type_id',
                '^кирп\.?$' => 1,
                '^монолитн?\.?$' => 2,
                '^пан\.?$' => 3,
                '^дерев\.?$' => 4,
                '^брус$' => 5,
                '^монолит.+?\-кирп\.?$' => 7,
            },

            room_schemes => {
                __field__ => 'room_scheme_id',
                '^студия$' => 1,
                '^кухня\-гостиная$' => 2,
                '^комн\.?\s+разд\.?$' => 3,
                '^разд\.?\s+комн\.?$' => 3,
                '^комн\.?\s+смежн\.?$' => 4,
                '^смежн\.?\s+комн\.?$' => 4,
                'икарус' => 5,
            },
        },

        ao_parent_guid => 'a4859da8-9977-4b62-8436-4e1b98c5d13f',
        default_phone_prefix => '4212',
    }
};

$media->metadata(encode_json $metadata);
$media->save;
